Revit 2024 API
ParameterTypeId.EnergyAnalysisShadeDepth Property
 "Shade Depth"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId EnergyAnalysisShadeDepth { get; }
Visual Basic
Public Shared ReadOnly Property EnergyAnalysisShadeDepth As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ EnergyAnalysisShadeDepth {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace